loogg/HPM6750_Boot/libraries/hpm_sdk/soc/ip/hpm_sdp_regs.h
/* Bitfield definition for register: PKTCNT */
/*
 * CNTVAL (RO)
 *
 * This read-only field shows the current (instantaneous) value of the packet counter
 */
#define SDP_PKTCNT_CNTVAL_MASK (0xFF0000UL)
#define SDP_PKTCNT_CNTVAL_SHIFT (16U)
#define SDP_PKTCNT_CNTVAL_GET(x) (((uint32_t)(x) & SDP_PKTCNT_CNTVAL_MASK) >> SDP_PKTCNT_CNTVAL_SHIFT)

/*
 * CNTINCR (RW)
 *
 * The value written to this field is added to the spacket count.
 */
#define SDP_PKTCNT_CNTINCR_MASK (0xFFU)
#define SDP_PKTCNT_CNTINCR_SHIFT (0U)
#define SDP_PKTCNT_CNTINCR_SET(x) (((uint32_t)(x) << SDP_PKTCNT_CNTINCR_SHIFT) & SDP_PKTCNT_CNTINCR_MASK)
#define SDP_PKTCNT_CNTINCR_GET(x) (((uint32_t)(x) & SDP_PKTCNT_CNTINCR_MASK) >> SDP_PKTCNT_CNTINCR_SHIFT)

/* Bitfield definition for register: STA */
/*
 * TAG (RO)
 *
 * packet tag.
 */
#define SDP_STA_TAG_MASK (0xFF000000UL)
#define SDP_STA_TAG_SHIFT (24U)
#define SDP_STA_TAG_GET(x) (((uint32_t)(x) & SDP_STA_TAG_MASK) >> SDP_STA_TAG_SHIFT)

/*
 * IRQ (W1C)
 *
 * interrupt Request, requested when error happen, or when packet processing done, packet counter reach to zero.
 */
#define SDP_STA_IRQ_MASK (0x800000UL)
#define SDP_STA_IRQ_SHIFT (23U)
#define SDP_STA_IRQ_SET(x) (((uint32_t)(x) << SDP_STA_IRQ_SHIFT) & SDP_STA_IRQ_MASK)
#define SDP_STA_IRQ_GET(x) (((uint32_t)(x) & SDP_STA_IRQ_MASK) >> SDP_STA_IRQ_SHIFT)

/*
 * CHN1PKT0 (W1C)
 *
 * the chain buffer "chain" bit is "1", while packet counter is "0", now, waiting for new buffer data.
 */
#define SDP_STA_CHN1PKT0_MASK (0x100000UL)
#define SDP_STA_CHN1PKT0_SHIFT (20U)
#define SDP_STA_CHN1PKT0_SET(x) (((uint32_t)(x) << SDP_STA_CHN1PKT0_SHIFT) & SDP_STA_CHN1PKT0_MASK)
#define SDP_STA_CHN1PKT0_GET(x) (((uint32_t)(x) & SDP_STA_CHN1PKT0_MASK) >> SDP_STA_CHN1PKT0_SHIFT)

/*
 * AESBSY (RO)
 *
 * AES Busy
 */
#define SDP_STA_AESBSY_MASK (0x80000UL)
#define SDP_STA_AESBSY_SHIFT (19U)
#define SDP_STA_AESBSY_GET(x) (((uint32_t)(x) & SDP_STA_AESBSY_MASK) >> SDP_STA_AESBSY_SHIFT)

/*
 * HASBSY (RO)
 *
 * Hashing Busy
 */
#define SDP_STA_HASBSY_MASK (0x40000UL)
#define SDP_STA_HASBSY_SHIFT (18U)
#define SDP_STA_HASBSY_GET(x) (((uint32_t)(x) & SDP_STA_HASBSY_MASK) >> SDP_STA_HASBSY_SHIFT)

/*
 * PKTCNT0 (W1C)
 *
 * Packet Counter registers reachs to ZERO now.
 */
#define SDP_STA_PKTCNT0_MASK (0x20000UL)
#define SDP_STA_PKTCNT0_SHIFT (17U)
#define SDP_STA_PKTCNT0_SET(x) (((uint32_t)(x) << SDP_STA_PKTCNT0_SHIFT) & SDP_STA_PKTCNT0_MASK)
#define SDP_STA_PKTCNT0_GET(x) (((uint32_t)(x) & SDP_STA_PKTCNT0_MASK) >> SDP_STA_PKTCNT0_SHIFT)

/*
 * PKTDON (W1C)
 *
 * Packet processing done, will trigger this itnerrrupt when the "PKTINT" bit set in the packet control word.
 */
#define SDP_STA_PKTDON_MASK (0x10000UL)
#define SDP_STA_PKTDON_SHIFT (16U)
#define SDP_STA_PKTDON_SET(x) (((uint32_t)(x) << SDP_STA_PKTDON_SHIFT) & SDP_STA_PKTDON_MASK)
#define SDP_STA_PKTDON_GET(x) (((uint32_t)(x) & SDP_STA_PKTDON_MASK) >> SDP_STA_PKTDON_SHIFT)

/*
 * ERRSET (W1C)
 *
 * Working mode setup error.
 */
#define SDP_STA_ERRSET_MASK (0x20U)
#define SDP_STA_ERRSET_SHIFT (5U)
#define SDP_STA_ERRSET_SET(x) (((uint32_t)(x) << SDP_STA_ERRSET_SHIFT) & SDP_STA_ERRSET_MASK)
#define SDP_STA_ERRSET_GET(x) (((uint32_t)(x) & SDP_STA_ERRSET_MASK) >> SDP_STA_ERRSET_SHIFT)

/*
 * ERRPKT (W1C)
 *
 * Packet head access error, or status update error.
 */
#define SDP_STA_ERRPKT_MASK (0x10U)
#define SDP_STA_ERRPKT_SHIFT (4U)
#define SDP_STA_ERRPKT_SET(x) (((uint32_t)(x) << SDP_STA_ERRPKT_SHIFT) & SDP_STA_ERRPKT_MASK)
#define SDP_STA_ERRPKT_GET(x) (((uint32_t)(x) & SDP_STA_ERRPKT_MASK) >> SDP_STA_ERRPKT_SHIFT)

/*
 * ERRSRC (W1C)
 *
 * Source Buffer Access Error
 */
#define SDP_STA_ERRSRC_MASK (0x8U)
#define SDP_STA_ERRSRC_SHIFT (3U)
#define SDP_STA_ERRSRC_SET(x) (((uint32_t)(x) << SDP_STA_ERRSRC_SHIFT) & SDP_STA_ERRSRC_MASK)
#define SDP_STA_ERRSRC_GET(x) (((uint32_t)(x) & SDP_STA_ERRSRC_MASK) >> SDP_STA_ERRSRC_SHIFT)

/*
 * ERRDST (W1C)
 *
 * Destination Buffer Error
 */
#define SDP_STA_ERRDST_MASK (0x4U)
#define SDP_STA_ERRDST_SHIFT (2U)
#define SDP_STA_ERRDST_SET(x) (((uint32_t)(x) << SDP_STA_ERRDST_SHIFT) & SDP_STA_ERRDST_MASK)
#define SDP_STA_ERRDST_GET(x) (((uint32_t)(x) & SDP_STA_ERRDST_MASK) >> SDP_STA_ERRDST_SHIFT)

/*
 * ERRHAS (W1C)
 *
 * Hashing Check Error
 */
#define SDP_STA_ERRHAS_MASK (0x2U)
#define SDP_STA_ERRHAS_SHIFT (1U)
#define SDP_STA_ERRHAS_SET(x) (((uint32_t)(x) << SDP_STA_ERRHAS_SHIFT) & SDP_STA_ERRHAS_MASK)
#define SDP_STA_ERRHAS_GET(x) (((uint32_t)(x) & SDP_STA_ERRHAS_MASK) >> SDP_STA_ERRHAS_SHIFT)

/*
 * ERRCHAIN (W1C)
 *
 * buffer chain error happen when packet's CHAIN bit=0, but the Packet counter is still not zero.
 */
#define SDP_STA_ERRCHAIN_MASK (0x1U)
#define SDP_STA_ERRCHAIN_SHIFT (0U)
#define SDP_STA_ERRCHAIN_SET(x) (((uint32_t)(x) << SDP_STA_ERRCHAIN_SHIFT) & SDP_STA_ERRCHAIN_MASK)
#define SDP_STA_ERRCHAIN_GET(x) (((uint32_t)(x) & SDP_STA_ERRCHAIN_MASK) >> SDP_STA_ERRCHAIN_SHIFT)

/* Bitfield definition for register: KEYADDR */
/*
 * INDEX (RW)
 *
 * To write a key to the SDP KEY RAM, the software must first write the desired key index/subword to this register.
 * Key index pointer. The valid indices are 0-[number_keys].
 * In the SDP, there is a 16x128 key ram can store 16 AES128 keys or 8 AES 256 Keys; this index is for addressing the 16 128-bit key addresses.
 */
#define SDP_KEYADDR_INDEX_MASK (0xFF0000UL)
#define SDP_KEYADDR_INDEX_SHIFT (16U)
#define SDP_KEYADDR_INDEX_SET(x) (((uint32_t)(x) << SDP_KEYADDR_INDEX_SHIFT) & SDP_KEYADDR_INDEX_MASK)
#define SDP_KEYADDR_INDEX_GET(x) (((uint32_t)(x) & SDP_KEYADDR_INDEX_MASK) >> SDP_KEYADDR_INDEX_SHIFT)

/*
 * SUBWRD (RW)
 *
 * Key subword pointer. The valid indices are 0-3. After each write to the key data register, this field
 * increments; To write a key, the software must first write the desired key index/subword to this register.
 */
#define SDP_KEYADDR_SUBWRD_MASK (0x3U)
#define SDP_KEYADDR_SUBWRD_SHIFT (0U)
#define SDP_KEYADDR_SUBWRD_SET(x) (((uint32_t)(x) << SDP_KEYADDR_SUBWRD_SHIFT) & SDP_KEYADDR_SUBWRD_MASK)
#define SDP_KEYADDR_SUBWRD_GET(x) (((uint32_t)(x) & SDP_KEYADDR_SUBWRD_MASK) >> SDP_KEYADDR_SUBWRD_SHIFT)

/* Bitfield definition for register: KEYDAT */
/*
 * KEYDAT (RW)
 *
 * This register provides the write access to the key/key subword specified by the key index register.
 * Writing this location updates the selected subword for the key located at the index
 * specified by the key index register. The write also triggers the SUBWORD field of the
 * KEY register to increment to the next higher word in the key
 */
#define SDP_KEYDAT_KEYDAT_MASK (0xFFFFFFFFUL)
#define SDP_KEYDAT_KEYDAT_SHIFT (0U)
#define SDP_KEYDAT_KEYDAT_SET(x) (((uint32_t)(x) << SDP_KEYDAT_KEYDAT_SHIFT) & SDP_KEYDAT_KEYDAT_MASK)
#define SDP_KEYDAT_KEYDAT_GET(x) (((uint32_t)(x) & SDP_KEYDAT_KEYDAT_MASK) >> SDP_KEYDAT_KEYDAT_SHIFT)

/* Bitfield definition for register array: CIPHIV */
/*
 * CIPHIV (RW)
 *
 * cipher initialization vector.
 */
#define SDP_CIPHIV_CIPHIV_MASK (0xFFFFFFFFUL)
#define SDP_CIPHIV_CIPHIV_SHIFT (0U)
#define SDP_CIPHIV_CIPHIV_SET(x) (((uint32_t)(x) << SDP_CIPHIV_CIPHIV_SHIFT) & SDP_CIPHIV_CIPHIV_MASK)
#define SDP_CIPHIV_CIPHIV_GET(x) (((uint32_t)(x) & SDP_CIPHIV_CIPHIV_MASK) >> SDP_CIPHIV_CIPHIV_SHIFT)

/* Bitfield definition for register array: HASWRD */
/*
 * HASWRD (RW)
 *
 * Hash Data Word x - HASH result bit; will store the expected hash result bit if hash check enabled; when hash check is not enabled,  the hash engine will store the final hash result[31:0] here.
 * If CRC mode enabled, this work store the CRC expected result if the check enabled, or store the final calcuated CRC result.
 */
#define SDP_HASWRD_HASWRD_MASK (0xFFFFFFFFUL)
#define SDP_HASWRD_HASWRD_SHIFT (0U)
#define SDP_HASWRD_HASWRD_SET(x) (((uint32_t)(x) << SDP_HASWRD_HASWRD_SHIFT) & SDP_HASWRD_HASWRD_MASK)
#define SDP_HASWRD_HASWRD_GET(x) (((uint32_t)(x) & SDP_HASWRD_HASWRD_MASK) >> SDP_HASWRD_HASWRD_SHIFT)

/* Bitfield definition for register: CMDPTR */
/*
 * CMDPTR (RW)
 *
 * current command addresses the register points to the multiword
 * descriptor that is to be executed (or is currently being executed)
 */
#define SDP_CMDPTR_CMDPTR_MASK (0xFFFFFFFFUL)
#define SDP_CMDPTR_CMDPTR_SHIFT (0U)
#define SDP_CMDPTR_CMDPTR_SET(x) (((uint32_t)(x) << SDP_CMDPTR_CMDPTR_SHIFT) & SDP_CMDPTR_CMDPTR_MASK)
#define SDP_CMDPTR_CMDPTR_GET(x) (((uint32_t)(x) & SDP_CMDPTR_CMDPTR_MASK) >> SDP_CMDPTR_CMDPTR_SHIFT)

